Repository: shuiandy/Reframe
Catalog: Strings/*/SettingsPage.resw
Source language: en_us
Languages: zh_cn

# Title.Text
source: Settings
zh_cn: 设置

# AppearanceHeader.Text
source: Appearance
zh_cn: 外观

# AppearanceDesc.Text
source: Theme and the main window's backdrop material; changes apply immediately. Acrylic falls back to a solid color when the window loses focus (system behavior).
zh_cn: 主题与主窗口的背景材质,改即生效。亚克力在窗口失焦时会回退为纯色(系统行为)。

# LanguageCombo.Header
source: Language
zh_cn: 语言

# LanguageSystem.Content
source: Follow system
zh_cn: 跟随系统

# ThemeCombo.Header
source: Theme
zh_cn: 主题

# ThemeSystem.Content
source: Follow system
zh_cn: 跟随系统

# ThemeLight.Content
source: Light
zh_cn: 浅色

# ThemeDark.Content
source: Dark
zh_cn: 深色

# BackdropCombo.Header
source: Window backdrop material
zh_cn: 窗口背景材质

# BackdropMica.Content
source: Mica
zh_cn: 云母(Mica)

# BackdropMicaAlt.Content
source: Mica Alt
zh_cn: 云母变体(Mica Alt)

# BackdropAcrylic.Content
source: Acrylic (frosted glass)
zh_cn: 亚克力(毛玻璃)

# RestartDialogTitle
source: Restart required
zh_cn: 需要重启

# RestartDialogBody
source: The display language changes after you restart Reframe.
zh_cn: 重启 Reframe 后显示语言生效。

# RestartNowButton
source: Restart now (will prompt for UAC)
zh_cn: 立即重启(会弹 UAC)

# RestartLaterButton
source: Later
zh_cn: 稍后

# SgdbHeader.Text
source: Online icons (SteamGridDB)
zh_cn: 在线图标(SteamGridDB)

# SgdbDescLine1.Text
source: When a game icon can't be read locally (anti-cheat protection, etc.), fetch one online by game name as a fallback. Enabled only when a free API key is filled in; leave empty to silently disable.
zh_cn: 本地取不到游戏图标(反作弊保护等)时,按游戏名联网取图标作为兜底。填入免费 API key 才启用,留空则静默关闭。

# SgdbDescApply.Text
source: Free sign-up:
zh_cn: 免费申请:

# SgdbKeyBox.PlaceholderText
source: Empty = online icons off
zh_cn: 留空 = 关闭在线图标

# PollHeader.Text
source: Poll interval
zh_cn: 轮询间隔

# PollDesc.Text
source: The engine's fallback scan period (milliseconds); lower is more responsive but uses more CPU.
zh_cn: 引擎兜底扫描的周期(毫秒),越小越灵敏但越费 CPU。

# StartupHeader.Text
source: Run at startup
zh_cn: 开机自启

# StartupDesc.Text
source: Start with administrator rights at logon (scheduled task, no UAC prompt).
zh_cn: 以管理员权限随登录启动(计划任务,免 UAC 弹窗)。

# DragSnapHeader.Text
source: Drag-snap
zh_cn: 拖拽吸附

# DragSnapDesc.Text
source: Hold Shift while dragging any window to show the zone overlay; release to snap the window into the zone under the cursor.
zh_cn: 按住 Shift 拖动任意窗口时显示分区覆盖层,松手把窗口吸进所在分区。

# TakeoverHeader.Text
source: Window takeover
zh_cn: 窗口接管

# TakeoverDesc.Text
source: Restore every window Reframe has modified to its style and position before takeover.
zh_cn: 把所有被 Reframe 改过的窗口还原为接管前的样式与位置。

# RestoreAllButton.Content
source: Restore all taken-over windows
zh_cn: 还原全部已接管窗口

# HotkeysHeader.Text
source: Hotkeys
zh_cn: 热键

# HotkeysDesc.Text
source: Global hotkeys. A gesture looks like Ctrl+Alt+D or Ctrl+Shift+1 (modifiers Ctrl/Alt/Shift/Win + a letter/digit/F1-F12, case-insensitive). Press "Apply hotkeys" to take effect; if a combo is already taken by another program or the system, it's reported below and in the dashboard log—just pick another.
zh_cn: 全局热键。手势形如 Ctrl+Alt+D、Ctrl+Shift+1(修饰符 Ctrl/Alt/Shift/Win + 字母/数字/F1-F12,大小写不限)。改完按「应用热键」生效;若某组合被别的程序或系统占用,会在下方与仪表盘日志提示,换一个即可。

# Hotkey_ToggleBorderless
source: Borderless toggle (foreground window)
zh_cn: 无边框开关(前台窗口)

# Hotkey_SendToZone1
source: Send to zone 1
zh_cn: 送入分区 1

# Hotkey_SendToZone2
source: Send to zone 2
zh_cn: 送入分区 2

# Hotkey_SendToZone3
source: Send to zone 3
zh_cn: 送入分区 3

# ApplyHotkeysButton.Content
source: Apply hotkeys
zh_cn: 应用热键

# ResetHotkeysButton.Content
source: Reset to defaults
zh_cn: 恢复默认

# BackupHeader.Text
source: Config backup
zh_cn: 配置备份

# BackupDesc.Text
source: Export the current config as config.json, or import one from a file (import validates and overwrites the current config).
zh_cn: 把当前配置导出为 config.json,或从文件导入(导入会校验并覆盖当前配置)。

# ExportConfigButton.Content
source: Export config…
zh_cn: 导出配置…

# ImportConfigButton.Content
source: Import config…
zh_cn: 导入配置…

# ConfigFileHeader.Text
source: Config file
zh_cn: 配置文件

# OpenFolderButton.Content
source: Open containing folder
zh_cn: 打开所在文件夹

# AboutHeader.Text
source: About
zh_cn: 关于

# AboutBlurb.Text
source: Reframe — a personal window manager: borderless + per-monitor adaptive layout.
zh_cn: Reframe — 自用窗口管理器:无边框化 + 按显示器自适应布局。

# VersionFormat
source: Version {0}
zh_cn: 版本 {0}

# HotkeyInvalidPrefix
source: Invalid gesture: {0}
zh_cn: 手势无效:{0}

# HotkeySaved
source: Saved.
zh_cn: 已保存。

# HotkeyRegisterFailedPrefix
source: These hotkeys failed to register: {0}
zh_cn: 以下热键注册失败:{0}

# HotkeyAllRegistered
source: Applied; all hotkeys registered successfully.
zh_cn: 已应用,全部热键注册成功。

# BackupExported
source: Config exported.
zh_cn: 已导出配置。

# BackupExportFailed
source: Export was cancelled or failed.
zh_cn: 导出已取消或失败。

# BackupImported
source: Imported.
zh_cn: 已导入。

# BackupImportFailed
source: Import was cancelled or the file is invalid.
zh_cn: 导入已取消或文件无效。

# StartupFailedTitle
source: Operation failed
zh_cn: 操作失败

# StartupEnableFailed
source: Failed to create the run-at-startup scheduled task.
zh_cn: 创建开机自启计划任务失败。

# StartupDisableFailed
source: Failed to delete the run-at-startup scheduled task.
zh_cn: 删除开机自启计划任务失败。
